app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'edo@gmail.com'
---
    public function attempt()
    {
        $email = trim((string)$this->request->getPost('email'));
        $pass  = (string)$this->request->getPost('password');

        $db  = \Config\Database::connect();
        $row = $db->table('users')->where('email', $email)->get()->getRowArray();