app/Controllers/employee.php

SELECT *
FROM `karyawan`
WHERE `user_id` = 21
---
    private function currentKaryawanId(): ?int
    {
        $uid = (int) session('user_id');
        if (!$uid) return null;
        $db = \Config\Database::connect();
        $row = $db->table('karyawan')->where('user_id', $uid)->get()->getRowArray();

INSERT INTO `cuti` (`karyawan_id`, `pemilik_id`, `tgl_pengajuan`, `tgl_mulai`, `tgl_selesai`, `jenis`, `alasan`, `status`, `created_at`) VALUES (22, NULL, '2025-12-18', '2025-12-18', '2025-12-19', 'tahunan', 'Liburan', 'menunggu', '2025-12-18 12:45:52')
---
        }

        $m = new CutiModel();
        $m->insert([
            'karyawan_id'  => $kid,
            'pemilik_id'   => null,
            'tgl_pengajuan' => date('Y-m-d'),
            'tgl_mulai'    => $tglMulai,
            'tgl_selesai'  => $tglSelesai,
            'jenis'        => $this->request->getPost('jenis'),
            'alasan'       => $this->request->getPost('alasan'),
            'status'       => 'menunggu',
            'created_at'   => date('Y-m-d H:i:s'),
        ]);