app/Controllers/owner.php

    private function currentPemilikId(): ?int
    {
        // cari id pemilik berdasarkan users.id yang login
        $uid = (int) session('user_id');
        if (!$uid) return null;
        $db = \Config\Database::connect();
        $row = $db->table('pemilik')->where('user_id', $uid)->get()->getRowArray();
---
SELECT *
FROM `pemilik`
WHERE `user_id` = 4

    public function cutiShow(int $id)
    {
        $m = new CutiModel();
        $row = $m->select('cuti.*, users.name, users.email')
            ->join('karyawan', 'karyawan.id = cuti.karyawan_id', 'left')
            ->join('users',    'users.id = karyawan.user_id',   'left')
            ->find($id);
---
SELECT `cuti`.*, `users`.`name`, `users`.`email`
FROM `cuti`
LEFT JOIN `karyawan` ON `karyawan`.`id` = `cuti`.`karyawan_id`
LEFT JOIN `users` ON `users`.`id` = `karyawan`.`user_id`
WHERE `cuti`.`id` = 29

    public function cutiApprove(int $id)
    {
        $m = new CutiModel();
        if (!$m->find($id)) return redirect()->to('/owner/cuti')->with('error', 'Pengajuan tidak ditemukan.');

        $pemilikId = $this->currentPemilikId();
        $m->update($id, ['status' => 'disetujui', 'pemilik_id' => $pemilikId]);
---
SELECT *
FROM `cuti`
WHERE `cuti`.`id` = 29
UPDATE `cuti` SET `status` = 'disetujui', `pemilik_id` = NULL
WHERE `cuti`.`id` IN (29)