app/Models/CutiModel.php

SELECT COUNT(*) AS `numrows`
FROM `cuti`
LEFT JOIN `karyawan` ON `karyawan`.`id` = `cuti`.`karyawan_id`
LEFT JOIN `users` ON `users`.`id` = `karyawan`.`user_id`
WHERE `cuti`.`status` = 'menunggu'
SELECT `cuti`.*, `karyawan`.`id` AS `k_id`, `users`.`name`, `users`.`email`, `users`.`id` AS `u_id`
FROM `cuti`
LEFT JOIN `karyawan` ON `karyawan`.`id` = `cuti`.`karyawan_id`
LEFT JOIN `users` ON `users`.`id` = `karyawan`.`user_id`
WHERE `cuti`.`status` = 'menunggu'
ORDER BY `cuti`.`id` DESC
 LIMIT 10
---
    public function getPaged(string $q = '', string $status = '', int $perPage = 10)
    {
        $builder = $this->select('cuti.*, karyawan.id AS k_id, users.name, users.email, users.id AS u_id')
            ->join('karyawan', 'karyawan.id = cuti.karyawan_id', 'left')
            ->join('users',    'users.id = karyawan.user_id',   'left')
            ->orderBy('cuti.id', 'DESC');

        if ($q !== '') {
            $builder->groupStart()
                ->like('users.name', $q)
                ->orLike('users.email', $q)
                ->orLike('cuti.alasan', $q)
                ->groupEnd();
        }
        if ($status !== '') {
            $builder->where('cuti.status', $status); // menunggu/disetujui/ditolak
        }
        return $builder->paginate($perPage);

SELECT COUNT(*) AS `numrows`
FROM `cuti`
WHERE `status` = 'menunggu'
---
    public function countByStatus(string $status): int
    {
        return $this->where('status', $status)->countAllResults();