app/Models/IzinModel.php

SELECT COUNT(*) AS `numrows`
FROM `izin`
WHERE `status` = 'menunggu'
---
    public function countByStatus(string $status): int
    {
        return $this->where('status', $status)->countAllResults();